# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Python 3
brew 'python3'

# Install Ruby
brew 'ruby'

# Install Git
brew 'git'

# Install Jrnl
brew `jrnl`

# Install more recent versions of some macOS tools
# brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'sqlite'
brew 'trash'
brew 'wget'
brew 'wifi-password'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'microsoft-azure-storage-explorer'
cask 'caffeine'
cask 'bestres'
cask 'dash'
cask `datagrip`
cask 'dropbox'
cask 'filezilla'
cask `fluid`
cask 'google-chrome'
cask 'gpgtools'
cask `harvest`
cask 'hyper'
cask 'imageoptim'
cask `libreoffice`
cask `microsoft-office`
cask 'slack-beta'
cask 'skype'
cask 'skype-for-business'
cask `spectacle`
cask 'spotify'
cask `sql-operations-studio`
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask `visual-studio-code-insiders`

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Byword', id: 420212497
mas 'Cinch', id: 412529613
mas 'Deliveries', id: 924726344
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Soulver', id: 413965349
mas 'Tweetbot', id: 557168941
