# Taps
tap "caskroom/cask"
# tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/php"
tap "microsoft/mssql-release"


# Install ZSH
brew "zsh"
brew "zsh-completions"

# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"

# Install GNU "find", "locate", "updatedb", and "xargs", g-prefixed
brew "findutils"

# Install Bash 5
brew "bash"

# Install Python 3
brew "python3"

# Install Ruby
brew "ruby"

# Install Git
brew "git"

# Install Jrnl
brew "jrnl"

# Install MS SQL Tools
brew "msodbcsql17"
brew "mssql-tools"

# Install more recent versions of some macOS tools
# brew "homebrew/dupes/grep"

# Install Binaries
brew "awscli"
brew "azure-cli"
brew "diff-so-fancy"
brew "heroku/brew/heroku"
brew "hub"
brew "imagemagick"
brew "mackup"
brew "mas"
brew "node"
brew "nvm"
brew "sqlite"
brew "trash"
brew "tree"
brew "wget"
brew "wifi-password"

# Apps
cask "1password"
cask "adobe-creative-cloud"
cask "authy"
cask "azure-data-studio"
cask "bestres"
cask "caffeine"
cask "dash"
cask "dash"
cask "docker-toolbox"
cask "dotnet"
cask "dropbox"
cask "filezilla"
cask "fluid"
cask "google-chrome"
cask "gpgtools"
cask "gfxstatus"
cask "imageoptim"
cask "iterm2"
cask "lepton"
cask "libreoffice"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "mongodb-compass"
cask "mjml"
cask "muzzle"
cask "postman"
cask "quitter"
cask "ripcord"
cask "robo-3t"
cask "skype"
cask "slack-beta"
cask "soulver"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "transmit"
cask "visual-studio-code"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Fonts
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Install Mac App Store apps
mas "1Blocker", id: 1107421413
mas "Byword", id: 420212497
mas "Cinch", id: 412529613
mas "Deliveries", id: 924726344
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "StopTheMadness", id: 1376402589
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
